read_verilog ../srcs/components/fifo.v
proc; fsm; opt; memory; opt
techmap; opt
check
# cover -o cvrg.rpt
show;
write_verilog ../srcs/components/fifo_synth.v
