read_verilog ../srcs/components/fifo.v
read_verilog ../srcs/switch/simple_mesh_xy/switch_constants.v
read_verilog ../srcs/switch/simple_mesh_xy/packet_arbiter.v
read_verilog ../srcs/switch/simple_mesh_xy/router_xy.v
read_verilog ../srcs/switch/simple_mesh_xy/crossbar.v
read_verilog ../srcs/switch/simple_mesh_xy/control_unit.v
read_verilog ../srcs/switch/simple_mesh_xy/xy_switch.v
proc; fsm; opt; memory; opt
techmap; opt
check
# cover -o cvrg.rpt
show xy_switch;
write_verilog ../srcs/switch/simple_mesh_xy/xy_synth.v
